In [1]:
import pandas as pd
import numpy as np

In [5]:
df = pd.read_csv('./Octane.csv')
type(df)
df

    Sample  Material1  Material2  Material3  Condition  Octane
0        1      55.33       1.72         54    1.66219   92.19
1        2      59.13       1.20         53    1.58399   92.74
2        3      57.39       1.42         55    1.61731   91.88
3        4      56.43       1.78         55    1.66228   92.80
4        5      55.98       1.58         54    1.63195   92.56
..     ...        ...        ...        ...        ...     ...
77      78      67.60       1.84         55    1.64758   91.86
78      79      64.81       2.24         54    1.69592   91.61
79      80      63.13       1.60         52    1.66118   92.17
80      81      63.48       3.46         52    1.48216   91.56
81      82      62.25       3.56         50    1.49734   92.16

[82 rows x 6 columns]

In [6]:
print(df['Material1'])

0     55.33
1     59.13
2     57.39
3     56.43
4     55.98
      ...
77    67.60
78    64.81
79    63.13
80    63.48
81    62.25
Name: Material1, Length: 82, dtype: float64

In [8]:
m1_mean = df['Material1'].mean()
m2_mean = df['Material2'].mean()
m3_mean = df['Material3'].mean()

cond_mean = df['Condition'].mean()

octane_mean = df['Octane'].mean()

cond_std = df['Condition'].std()
print(cond_std)

print(df['Material2'].max())
print(df['Material2'].min())

0.2197298227524435
10.76
0.0

In [9]:
df.describe()

          Sample  Material1  Material2  Material3  Condition     Octane
count  82.000000   82.00000  82.000000  82.000000  82.000000  82.000000
mean   41.500000   60.17061   1.663659  55.463415   1.626571  91.849878
std    23.815261   12.43740   1.901952   5.377583   0.219730   1.401124
min     1.000000    4.23000   0.000000  40.000000   1.199750  89.660000
25%    21.250000   55.38000   0.105000  54.000000   1.518095  90.847500
50%    41.500000   62.69500   1.280000  56.000000   1.603575  91.735000
75%    61.750000   67.78000   2.277500  59.750000   1.722818  92.467500
max    82.000000   75.54000  10.760000  64.000000   2.319090  97.610000

In [11]:
df2 =pd.read_csv('https://raw.githubusercontent.com/TrainingByPackt/Data-Science-with-Python/master/Chapter01/Data/student.csv')
df2

     Student_id  Age  Gender      Grade Employed
0             1   19    Male  1st Class      yes
1             2   20  Female  2nd Class       no
2             3   18    Male  1st Class       no
3             4   21  Female  2nd Class       no
4             5   19    Male  1st Class       no
..          ...  ...     ...        ...      ...
227         228   21  Female  1st Class       no
228         229   20    Male  2nd Class       no
229         230   20    Male  3rd Class      yes
230         231   19  Female  1st Class      yes
231         232   20    Male  3rd Class      yes

[232 rows x 5 columns]

In [14]:
df2_numeric = df2.select_dtypes(include=[np.number])
print(df2_numeric)

     Student_id  Age
0             1   19
1             2   20
2             3   18
3             4   21
4             5   19
..          ...  ...
227         228   21
228         229   20
229         230   20
230         231   19
231         232   20

[232 rows x 2 columns]

In [15]:
df2_numeric = df2.select_dtypes(exclude=[np.number])
print(df2_numeric)

     Gender      Grade Employed
0      Male  1st Class      yes
1    Female  2nd Class       no
2      Male  1st Class       no
3    Female  2nd Class       no
4      Male  1st Class       no
..      ...        ...      ...
227  Female  1st Class       no
228    Male  2nd Class       no
229    Male  3rd Class      yes
230  Female  1st Class      yes
231    Male  3rd Class      yes

[232 rows x 3 columns]

In [17]:
print(df2['Grade'].unique())
print(df2['Grade'].nunique()) # number of unique values

['1st Class' '2nd Class' '3rd Class']
3

In [19]:
df2['Grade'].value_counts()

2nd Class    80
3rd Class    80
1st Class    72
Name: Grade, dtype: int64

In [27]:
pvt = pd.pivot_table(df2, values=['Student_id'], index=['Grade'], aggfunc=[np.count_nonzero])
print(pvt)

          count_nonzero
             Student_id
Grade
1st Class            72
2nd Class            80
3rd Class            80

In [29]:
df2['Gender'].replace({'Male': 1, 'Female': 2}, inplace=True)
print(df2)

     Student_id  Age  Gender      Grade Employed
0             1   19       1  1st Class      yes
1             2   20       2  2nd Class       no
2             3   18       1  1st Class       no
3             4   21       2  2nd Class       no
4             5   19       1  1st Class       no
..          ...  ...     ...        ...      ...
227         228   21       2  1st Class       no
228         229   20       1  2nd Class       no
229         230   20       1  3rd Class      yes
230         231   19       2  1st Class      yes
231         232   20       1  3rd Class      yes

[232 rows x 5 columns]

In [31]:
mat = np.random.randint(100, 1500, (3, 3))
df3 = pd.DataFrame(mat, index=['a', 'b', 'c'], columns=['c1', 'c2', 'c3'])
print(df3)

     c1    c2    c3
a  1233  1093   186
b   864  1265   790
c   500   983  1392

In [33]:
print(df3 * 10)
print(df3.transform(func= lambda x: x*10))

      c1     c2     c3
a  12330  10930   1860
b   8640  12650   7900
c   5000   9830  13920
      c1     c2     c3
a  12330  10930   1860
b   8640  12650   7900
c   5000   9830  13920

In [37]:
df3.transform(func=lambda x:x*x)

        c1       c2       c3
a  1520289  1194649    34596
b   746496  1600225   624100
c   250000   966289  1937664